In [1]:
import pandas as pd
import numpy as np

In [52]:
#. Create a DataFrame birds from the above dictionary data which has the index labels
data = {'birds': ['Cranes', 'Cranes', 'plovers', 'spoonbills', 'spoonbills', 'Cranes', 'plovers', 'Cranes', 'spoonbills', 'spoonbills', 'Cranes'], 
        'age': [3.5, 4, 1.5, np.nan, 6, 3, 5.5, np.nan, 8, 4, 3.5], 'visits': [2, 4, 3, 4, 3, 4, 2, 2, 3, 2, 2], 
        'priority': ['yes', 'yes', 'no', np.nan, 'no', 'no', 'no', 'yes', 'no', 'no','yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k']
birds=pd.DataFrame(data,index=labels)
birds

        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
c     plovers  1.5       3       no
d  spoonbills  NaN       4      NaN
e  spoonbills  6.0       3       no
f      Cranes  3.0       4       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no
k      Cranes  3.5       2      yes

In [53]:
#ii. Display basic information about the dataFrame
birds.head()

        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
c     plovers  1.5       3       no
d  spoonbills  NaN       4      NaN
e  spoonbills  6.0       3       no

In [54]:
birds.describe()

            age     visits
count  9.000000  11.000000
mean   4.333333   2.818182
std    1.903943   0.873863
min    1.500000   2.000000
25%    3.500000   2.000000
50%    4.000000   3.000000
75%    5.500000   3.500000
max    8.000000   4.000000

In [55]:
birds.info()

<class 'pandas.core.frame.DataFrame'>
Index: 11 entries, a to k
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   birds     11 non-null     object
 1   age       9 non-null      float64
 2   visits    11 non-null     int64
 3   priority  10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 440.0+ bytes

In [56]:
#iii. Show Alternate rows of the dataframe.
birds.iloc[::2]

        birds  age  visits priority
a      Cranes  3.5       2      yes
c     plovers  1.5       3       no
e  spoonbills  6.0       3       no
g     plovers  5.5       2       no
i  spoonbills  8.0       3       no
k      Cranes  3.5       2      yes

In [57]:
#i. Show only rows [1st, 3rd, 7th] from columns ['bird', 'age']
birds.iloc[[0,2,6]][['birds', 'age']]

     birds  age
a   Cranes  3.5
c  plovers  1.5
g  plovers  5.5

In [58]:
#ii. Select rows where the number of visits is less than 4.
birds[birds['visits']<4]

        birds  age  visits priority
a      Cranes  3.5       2      yes
c     plovers  1.5       3       no
e  spoonbills  6.0       3       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no
k      Cranes  3.5       2      yes

In [59]:
birds[birds['visits']<4]

        birds  age  visits priority
a      Cranes  3.5       2      yes
c     plovers  1.5       3       no
e  spoonbills  6.0       3       no
g     plovers  5.5       2       no
h      Cranes  NaN       2      yes
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no
k      Cranes  3.5       2      yes

In [60]:
birds[['age','visits']].isna()

     age  visits
a  False   False
b  False   False
c  False   False
d   True   False
e  False   False
f  False   False
g  False   False
h   True   False
i  False   False
j  False   False
k  False   False

In [61]:
#i. Select all rows with nan values in age and visits column.
birds[birds[['age','visits']].isna().any(axis=1)]

        birds  age  visits priority
d  spoonbills  NaN       4      NaN
h      Cranes  NaN       2      yes

In [62]:
#ii. Fill nan with respective series mode value.
def mode(series):
    frequency_dict = {}
    
    # Count the frequency of each element in the series
    for value in series:
        if value in frequency_dict:
            frequency_dict[value] += 1
        else:
            frequency_dict[value] = 1
    
    # Find the mode (the value with the highest frequency)
    mode_value = max(frequency_dict, key=frequency_dict.get)
    
    return mode_value

In [63]:
mode(birds['age'])

3.5

In [64]:
mode_value=birds['age'].mode()[0]

In [65]:
birds['age']=birds['age'].fillna(mode_value)

In [66]:
birds['age']

a    3.5
b    4.0
c    1.5
d    3.5
e    6.0
f    3.0
g    5.5
h    3.5
i    8.0
j    4.0
k    3.5
Name: age, dtype: float64

In [71]:
birds[birds['birds']=='Cranes'].visits.sum()

14

In [73]:
birds[birds['birds']=='Cranes']['visits'].sum()

14

In [74]:
f_map={}
for i in birds['birds']:
    if i in f_map:
        f_map[i]+=1
    else:
        f_map[i]=1

In [75]:
print(f_map)

{'Cranes': 5, 'plovers': 2, 'spoonbills': 4}

In [81]:
birds['birds'].value_counts()

birds
Cranes        5
spoonbills    4
plovers       2
Name: count, dtype: int64

In [84]:
birds['birds'].unique()

array(['Cranes', 'plovers', 'spoonbills'], dtype=object)

In [87]:
#Print no of duplicate rows
birds.duplicated().sum()

2

In [88]:
birds[birds.duplicated()]

    birds  age  visits priority
h  Cranes  3.5       2      yes
k  Cranes  3.5       2      yes

In [93]:
#iv. Drop Duplicates rows and make this changes permanent. Show dataframe after changes
birds=birds.drop_duplicates()

In [94]:
birds

        birds  age  visits priority
a      Cranes  3.5       2      yes
b      Cranes  4.0       4      yes
c     plovers  1.5       3       no
d  spoonbills  3.5       4      NaN
e  spoonbills  6.0       3       no
f      Cranes  3.0       4       no
g     plovers  5.5       2       no
i  spoonbills  8.0       3       no
j  spoonbills  4.0       2       no